01  STJ002-COMMAREA.
    02 STJ002-STRING           PIC X(4).
    02  STJ002-SALDIS          PIC S9(13)V99.
    02  STJ002-SALDIS-RED      REDEFINES STJ002-SALDIS PIC X(16).
    02  STJ002-ARRAY           PIC S9(2)V99 OCCURS 4 TIMES.
    02  STJ002-DATA            PIC 9(2)V99.
