01 MY-RECORD.
   03 FIELD-A         PIC 9999.
   03 FILLER          PIC X.
   03 FIELD-B         PIC 9(03).
   03 FILLER          PIC X.
   03 FIELD-C         PIC S9(9).
