01 MQCIH.
    15  MQCIH-CID PIC X(4) VALUE 'CIH '.
    15  MQCIH-VERSION PIC S9(9) BINARY VALUE 2.
    15  MQCIH-LENGTH PIC S9(9) BINARY VALUE 180.
    15  MQCIH-CODING PIC S9(9) BINARY VALUE 0.
    15  MQCIH-CODE PIC S9(9) BINARY VALUE 0.
    15  MQCIH-FORMATID PIC X(8) VALUE SPACES.
    15  MQCIH-FLAGSID PIC S9(9) BINARY VALUE 0.
    15  MQCIH-RETURNIDCODE PIC S9(9) BINARY VALUE 0.
    15  MQCIH-COMPIDCODE PIC S9(9) BINARY VALUE 0.
    15  MQCIH-REASONID PIC S9(9) BINARY VALUE 0.
    15  MQCIH-CONTROL PIC S9(9) BINARY VALUE 273.
    15  MQCIH-INTERVAL PIC S9(9) BINARY VALUE -2.
    15  MQCIH-FACILITY PIC X(8) VALUE LOW-VALUES.
    15  MQCIH-AUTHENTICATOR PIC X(8) VALUE SPACES.
