01 DATA1-DETAIL-REGISTRY.
   03 DATA1-REGISTRY-TYPE             PIC S9(002).
      88 DATA1-REGISTRY-TYPE-HEADER     VALUE 01.
      88 DATA1-REGISTRY-TYPE-DETAIL     VALUE 02.
      88 DATA1-REGISTRY-TYPE-TRAILLER   VALUE 99.
   03 DATA1-COMPANY                   PIC S9(003).
