01 DFHCOMMAREA.
   05 BROKER-MESSAGE-AREA.
      15 MI-HDR-VERSION                          PIC X(04).
      15 MI-HDR-MSGID                            PIC X(35).
      15 MI-HDR-LOGGINGID                        PIC X(35).
01 DFHCOMMAREA-2.
   05 BROKER-MESSAGE-AREA-2.
      15 MI-HDR-VERSION-2                          PIC X(04).
      15 MI-HDR-MSGID-2                            PIC X(35).
      15 MI-HDR-LOGGINGID-2                        PIC X(35).