01 STATUS-CODE        PIC  9(03) OCCURS 4 TIMES.
    88 ACCEPTED                   VALUE 202.
    88 OK                         VALUE 200.
    88 NOT-FOUND                  VALUE 404.
    88 FAILED                     VALUE 500.
