
01 MQCIH.
15  TRUCID PIC X(4) VALUE 'C4H '.
15  ERSION PIC S9(9) BINARY VALUE 4.
15  TRUCLENGTH PIC S9(9) BINARY VALUE 190.
15  NCODING PIC S9(9) BINARY VALUE 0.
15  ODEDCHARSETID PIC S9(9) BINARY VALUE 0.
15  ORMAT PIC X(8) VALUE SPACES.
15  LAGS PIC S9(9) BINARY VALUE 0.
15  ETURNCODE PIC S9(9) BINARY VALUE 0.
15  OMPCODE PIC S9(9) BINARY VALUE 0.
15  EASON PIC S9(9) BINARY VALUE 0.
15  OWCONTROL PIC S9(9) BINARY VALUE 208.
15  ETWAITINTERVAL PIC S9(9) BINARY VALUE -6.
15  INKTYPE PIC S9(9) BINARY VALUE 1.
15  UTPUTDATALENGTH PIC S9(9) BINARY VALUE -3.
15  ACILITYKEEPTIME PIC S9(9) BINARY VALUE 1.
15  DSDESCRIPTOR PIC S9(9) BINARY VALUE 0.
15  ONVERSATIONALTASK PIC S9(9) BINARY VALUE 2.
15  ASKENDSTATUS PIC S9(9) BINARY VALUE 0.
15  ACILITY PIC X(8) VALUE LOW-VALUES.
15  UNCTION PIC X(4) VALUE SPACES.
15  BENDCODE PIC X(4) VALUE SPACES.
15  UTHENTICATOR PIC X(8) VALUE SPACES.
15  ESERVED1 PIC X(8) VALUE SPACES.
15  EPLYTOFORMAT PIC X(8) VALUE SPACES.
15  EMOTESYSID PIC X(4) VALUE SPACES.
15  EMOTETRANSID PIC X(4) VALUE SPACES.
15  RANSACTIONID PIC X(4) VALUE SPACES.
15  ACILITYLIKE PIC X(4) VALUE SPACES.
15  TTENTIONID PIC X(4) VALUE SPACES.
15  TARTCODE PIC X(4) VALUE SPACES.
15  ANCELCODE PIC X(4) VALUE SPACES.
15  EXTTRANSACTIONID PIC X(4) VALUE SPACES.
15  ESERVED2 PIC X(8) VALUE SPACES.
15  ESERVED3 PIC X(8) VALUE SPACES.
15  URSORPOSITION PIC S9(9) BINARY VALUE 0.
15  RROROFFSET PIC S9(9) BINARY VALUE 0.
15  NPUTITEM PIC S9(9) BINARY VALUE 0.
15  ESERVED4 PIC S9(9) BINARY VALUE 0.
