01 Employee.
   03 EmployeeId                   PIC 9(3).
   03 ContractYears                PIC 9(2).
   03 Salary                       PIC 9(6).99.
   03 Bonus                        PIC 9(4).999.
