01 REGISTRY.
   03 COMPANY                   PIC X(003).

01 DATA-DETAIL-REGISTRY.
   03 DATA-REGISTRY-TYPE             PIC S9(002).
      88 DATA-REGISTRY-TYPE-HEADER     VALUE 01.
      88 DATA-REGISTRY-TYPE-DETAIL     VALUE 02.
      88 DATA-REGISTRY-TYPE-TRAILLER   VALUE 99.
   03 DATA-COMPANY                   PIC S9(003).
